package main

import (
	"fmt"
)

var name string
var phone string
var searchName string
var phoneBook = make(map[string]string)

func main() {

	for {
		var menu int

		fmt.Println("===================================")
		fmt.Println("            Phone Book             ")
		fmt.Println("===================================")
		fmt.Println("1) เพิ่มข้อมูลเบอร์โทรศัพท์")
		fmt.Println("2) ค้นหาข้อมูลเบอร์โทรศัพท์ตามชื่อ")
		fmt.Println("3) แสดงรายชื่อทั้งหมด")
		fmt.Println("4) ออกจากโปรแกรม")
		fmt.Println("===================================")
		fmt.Print("เลือกเมนู: ")
		fmt.Scan(&menu)
		fmt.Println() // เว้นบรรทัดหลังเลือกรายการ

		switch menu {
		case 1:
			fmt.Println("=== เพิ่มข้อมูลเบอร์โทรศัพท์ ===")
			fmt.Print("กรอกชื่อ: ")
			fmt.Scan(&name)
			fmt.Print("กรอกเบอร์โทรศัพท์: ")
			fmt.Scan(&phone)

			phoneBook[name] = phone
			fmt.Println("บันทึกข้อมูลเรียบร้อยแล้ว!")
			fmt.Println()

		case 2:
			fmt.Println("=== ค้นหาเบอร์โทรศัพท์ ===")
			fmt.Print("กรอกชื่อที่ต้องการค้นหา: ")
			fmt.Scan(&searchName)

			phone, ok := phoneBook[searchName]
			if ok {
				fmt.Println("ผลการค้นหา:")
				fmt.Printf("ชื่อ: %s → เบอร์โทรศัพท์: %s\n", searchName, phone)
			} else {
				fmt.Println("ไม่พบข้อมูลชื่อ:", searchName)
			}
			fmt.Println()

		case 3:
			fmt.Println("=== รายชื่อทั้งหมด ===")
			if len(phoneBook) == 0 {
				fmt.Println("ยังไม่มีข้อมูลในระบบ")
			} else {
				for key, value := range phoneBook {
					fmt.Printf("- ชื่อ: %-10s เบอร์: %s\n", key, value)
				}
			}
			fmt.Println()

		case 4:
			fmt.Println("ขอบคุณที่ใช้งานโปรแกรม 🚀")
			fmt.Println("จบการทำงาน...")
			return

		default:
			fmt.Println("กรุณากรอกตัวเลข 1-4 เท่านั้น")
			fmt.Println()
		}
	}
}
